posts/java-concurrency/index.org
** Thread
- Thread's *Execution State* with the ~Thread.getState()~ method
  returns ~Enum Thread.State~:
  - NEW :: not yet started
  - RUNNABLE :: executing
  - BLOCKED :: A thread that is blocked *waiting for a monitor locks*
  - WAITING :: waiting *indefinitely* for another thread to perform a
               particular action. A thread is in this state due to
               calling one of the following methods:
    - ~Object.wait()~
    - ~Thread.join()~
    - ~LockSupport.park()~
  - TIMED_WAITING :: waiting with a specified waiting time.
    - Apart from the timeout version of the above methods,
      ~Thread.sleep()~ also put thread into this state.
  - TERMINATED :: exited
  - Notice the difference between *BLOCKED* and *WAITING*.
  - Differenct WAITING status:
    - STATE: *BLOCKED (on object monitor)* : waiting for monitor entry,
      when using intrinsicLock, i.e., the ~synchronized~ keyword.
    - STATE: *WAITING (parking)*: waiting on condition, when using locks
      from ~java.util.concurrent~.

- Thread's priority is taken into consideration by OS's Scheduler.
  - ~void setPriority(int priority)~ : take value between
    *Thread.MIN_PRIORITY* and *Thread.MAX_PRIORITY*, and
    Thread.NORMAL_PRIORITY* identifies the default priority.
  - On Linux, the default scheduler is *Completely Fair Scheduler*
    - References:
      - [[https://en.wikipedia.org/wiki/Completely_Fair_Scheduler]]
      - [[http://www.informit.com/articles/article.aspx?p=101760]]
      - [[http://www.linuxjournal.com/magazine/completely-fair-scheduler]]
    - Use a *red-black tree* (self balanced binary tree) to sort process
      according to its *execution time*.
    - Process with lowest execution time is scheduled next to run.
    - Process running exceeding the max execution time is reinserted
      into the tree for further scheduling.
    - If a process spends a lot of its time sleeping, then its spent
      time value is low and it automatically gets the priority boost
      when it finally needs it
  - On Windows, it is *multilevel feedback queue scheduler*
- A *daemon thread* is a thread that acts as a helper to *nondaemon
  thread* and *dies* automatically when the application's last
  nondaemon thread dies so that the application can terminate.
- Application will not terminate when the nondaemon default main
  thread terminates until all background nondaemon threads
  terminate.
- Interrupting Threads
  - ~void interrupt()~
    - If this thread is *blocked* because a call to ~wait()~, ~sleep()~
      or ~join()~ methods, the thread's *interrupted status* is
      cleared and *InterruptedException* is thrown.
    - If this thread is *blocked* in an I/O operation on an
      *interruptible channel*, the channel will be closed, the
      interrupt status will be set and the thread will receive a
      *ClosedByInterruptException*.
    - If the thread is blocked in a *Selector*, then the interrupt
      status will be set and it will return immediately from the
      selection operation. possilby with a non-zero value.
    - Otherwise the interrupt status is set.
  - ~static boolean interrupted()~
    - Test whether the *current* thread has been interrupted. The
      interrupted status of the thread is cleard by this method.
  - ~boolean isInterrupted()~
    - Test whether this thread has been interrupted. The interrupted
      status of the thread is unaffected by this method.
- Joining Threads:
  - ~void join()~ : The calling/current* thread will wait for *this*
    thread to die. *InterruptedException* is thrown when any thread
    interrupted the *current* thread.
  - ~void join(long millis), void join(long millis, int nanos)~ :
    passing ~0~ to wait indefinitely.
  - This implementation uses a loop of ~this.wait~ calls conditioned
    on ~this.isAlive~. As a thread terminates the ~this.notifyAll~
    method is invoked.
  - _It is recommended that *applications* not use ~wait~, ~notify~, or
    ~notifyAll~ on Thread instances_.
- *Thread.UncaughtExceptionHandler*
  - A Thread can set a handler when this thread abruptly terminates
    due to an uncaught exception.
  - If the thread has not set a handler, its ThreadGroup (which
    implements the Handler interface) acts as its handler.
  - *static void setDefaultUncaughtExceptionHandler()* to set a global
    default handler for all thread and will be called when the thread
    has no handler set, and when its thread group (including parent
    thread groups) does not specialize its ~uncaughtException~ method.
- *ThreadGroup* can forms a tree like structure.
- Values stored in *thread-local* variables are not related.
- *InheritableThreadLocal* : When a child thread is created, the child
  receives *initial values* for all *inheritable thread-local
  variables* for which the parent has values.
  - ~protected T childValue(T parentValue)~: method used to calculate the
    child's initial value as a function of the parent's value at the
    time the child thread is created. This is called from within the
    parent thread before the child is started.
- *java.util.Timer* and *java.util.TimerTask* for simple job scheduler
  - Timer let you schedule TimerTask for future execution on a
    background thread, which is known as the /task-execution thread/.
  - Timer tasks may be scheduled for one-shot execution, or for
    repeated execution at regular intervals.
  - Timer scales to large numbers of concurrently scheduled timer
    tasks. /Thousands of tasks should present no problem/.
  - Timer can be set as a daemon which will make the /task-execution
    thread/ a daemon task.

