posts/notes/java-concurrency/index.html
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Thread</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Thread's <b>Execution State</b> with the <code>Thread.getState()</code> method
returns <code>Enum Thread.State</code>:
<dl class="org-dl">
<dt> NEW </dt>
<dd>not yet started
</dd>
<dt> RUNNABLE </dt>
<dd>executing
</dd>
<dt> BLOCKED </dt>
<dd>A thread that is blocked <b>waiting for a monitor locks</b>
</dd>
<dt> WAITING </dt>
<dd>waiting <b>indefinitely</b> for another thread to perform a
particular action. A thread is in this state due to
calling one of the following methods:
<ul class="org-ul">
<li>
<code>Object.wait()</code>
</li>
<li>
<code>Thread.join()</code>
</li>
<li>
<code>LockSupport.park()</code>
</li>
</ul>
</dd>
<dt> TIMED<sub>WAITING</sub>
</dt>
<dd>waiting with a specified waiting time.
<ul class="org-ul">
<li>Apart from the timeout version of the above methods,
<code>Thread.sleep()</code> also put thread into this state.
</li>
</ul>
</dd>
<dt> TERMINATED </dt>
<dd>exited
</dd>
<dt> (no term) </dt>
<dd>Notice the difference between <b>BLOCKED</b> and <b>WAITING</b>.
</dd>
<dt> (no term) </dt>
<dd>Differenct WAITING status:
<ul class="org-ul">
<li>STATE: <b>BLOCKED (on object monitor)</b> : waiting for monitor entry,
when using intrinsicLock, i.e., the <code>synchronized</code> keyword.
</li>
<li>STATE: <b>WAITING (parking)</b>: waiting on condition, when using locks
from <code>java.util.concurrent</code>.
</li>
</ul>
</dd>
</dl>
</li>

<li>Thread's priority is taken into consideration by OS's Scheduler.
<ul class="org-ul">
<li>
<code>void setPriority(int priority)</code> : take value between
<b>Thread.MIN<sub>PRIORITY</sub></b> and <b>Thread.MAX<sub>PRIORITY</sub></b>, and
Thread.NORMAL<sub>PRIORITY</sub>* identifies the default priority.
</li>
<li>On Linux, the default scheduler is <b>Completely Fair Scheduler</b>
<ul class="org-ul">
<li>References:
<ul class="org-ul">
<li>
<a href="https://en.wikipedia.org/wiki/Completely_Fair_Scheduler">https://en.wikipedia.org/wiki/Completely_Fair_Scheduler</a>
</li>
<li>
<a href="http://www.informit.com/articles/article.aspx?p=101760">http://www.informit.com/articles/article.aspx?p=101760</a>
</li>
<li>
<a href="http://www.linuxjournal.com/magazine/completely-fair-scheduler">http://www.linuxjournal.com/magazine/completely-fair-scheduler</a>
</li>
</ul>
</li>
<li>Use a <b>red-black tree</b> (self balanced binary tree) to sort process
according to its <b>execution time</b>.
</li>
<li>Process with lowest execution time is scheduled next to run.
</li>
<li>Process running exceeding the max execution time is reinserted
into the tree for further scheduling.
</li>
<li>If a process spends a lot of its time sleeping, then its spent
time value is low and it automatically gets the priority boost
when it finally needs it
</li>
</ul>
</li>
<li>On Windows, it is <b>multilevel feedback queue scheduler</b>
</li>
</ul>
</li>
<li>A <b>daemon thread</b> is a thread that acts as a helper to <b>nondaemon
thread</b> and <b>dies</b> automatically when the application's last
nondaemon thread dies so that the application can terminate.
</li>
<li>Application will not terminate when the nondaemon default main
thread terminates until all background nondaemon threads
terminate.
</li>
<li>Interrupting Threads
<ul class="org-ul">
<li>
<code>void interrupt()</code>
<ul class="org-ul">
<li>If this thread is <b>blocked</b> because a call to <code>wait()</code>, <code>sleep()</code>
or <code>join()</code> methods, the thread's <b>interrupted status</b> is
cleared and <b>InterruptedException</b> is thrown.
</li>
<li>If this thread is <b>blocked</b> in an I/O operation on an
<b>interruptible channel</b>, the channel will be closed, the
interrupt status will be set and the thread will receive a
<b>ClosedByInterruptException</b>.
</li>
<li>If the thread is blocked in a <b>Selector</b>, then the interrupt
status will be set and it will return immediately from the
selection operation. possilby with a non-zero value.
</li>
<li>Otherwise the interrupt status is set.
</li>
</ul>
</li>
<li>
<code>static boolean interrupted()</code>
<ul class="org-ul">
<li>Test whether the <b>current</b> thread has been interrupted. The
interrupted status of the thread is cleard by this method.
</li>
</ul>
</li>
<li>
<code>boolean isInterrupted()</code>
<ul class="org-ul">
<li>Test whether this thread has been interrupted. The interrupted
status of the thread is unaffected by this method.
</li>
</ul>
</li>
</ul>
</li>
<li>Joining Threads:
<ul class="org-ul">
<li>
<code>void join()</code> : The calling/current* thread will wait for <b>this</b>
thread to die. <b>InterruptedException</b> is thrown when any thread
interrupted the <b>current</b> thread.
</li>
<li>
<code>void join(long millis), void join(long millis, int nanos)</code> :
passing <code>0</code> to wait indefinitely.
</li>
<li>This implementation uses a loop of <code>this.wait</code> calls conditioned
on <code>this.isAlive</code>. As a thread terminates the <code>this.notifyAll</code>
method is invoked.
</li>
<li>
<span class="underline">It is recommended that <b>applications</b> not use <code>wait</code>, <code>notify</code>, or
<code>notifyAll</code> on Thread instances</span>.
</li>
</ul>
</li>
<li>
<b>Thread.UncaughtExceptionHandler</b>
<ul class="org-ul">
<li>A Thread can set a handler when this thread abruptly terminates
due to an uncaught exception.
</li>
<li>If the thread has not set a handler, its ThreadGroup (which
implements the Handler interface) acts as its handler.
</li>
<li>
<b>static void setDefaultUncaughtExceptionHandler()</b> to set a global
default handler for all thread and will be called when the thread
has no handler set, and when its thread group (including parent
thread groups) does not specialize its <code>uncaughtException</code> method.
</li>
</ul>
</li>
<li>
<b>ThreadGroup</b> can forms a tree like structure.
</li>
<li>Values stored in <b>thread-local</b> variables are not related.
</li>
<li>
<b>InheritableThreadLocal</b> : When a child thread is created, the child
receives <b>initial values</b> for all <b>inheritable thread-local
variables</b> for which the parent has values.
<ul class="org-ul">
<li>
<code>protected T childValue(T parentValue)</code>: method used to calculate the
child's initial value as a function of the parent's value at the
time the child thread is created. This is called from within the
parent thread before the child is started.
</li>
</ul>
</li>
<li>
<b>java.util.Timer</b> and <b>java.util.TimerTask</b> for simple job scheduler
<ul class="org-ul">
<li>Timer let you schedule TimerTask for future execution on a
background thread, which is known as the <i>task-execution thread</i>.
</li>
<li>Timer tasks may be scheduled for one-shot execution, or for
repeated execution at regular intervals.
</li>
<li>Timer scales to large numbers of concurrently scheduled timer
tasks. <i>Thousands of tasks should present no problem</i>.
</li>
<li>Timer can be set as a daemon which will make the <i>task-execution
thread</i> a daemon task.
</li>
</ul>
</li>
</ul>
</div>
</div>
