posts/java-concurrency/index.org
** Synchronization
- ~counter++~ : although a it might look like a single operation, it
  is actually three separate operations: read, add 1 and write. It is
  not thread safe.
- The compiler, the Java virtual machine (JVM), and the operating
  system can collaborate to cache a variable in a register or a
  processor-local cacherather than rely on main memory.
  - *Each thread* has its *own copy* of the variable.
  - When one thread writes to this variable, it’s writing to its copy;
  - Other threads are unlikely to see the update in their copies.
- Synchronization properties:
  - mutual exclusion :: each thread is mutually excluded from
       executing in critical section when another thread is inside the
       critical section.
    - the lock is often referred to as *mutex lock*
  - property of visibility ::  ensures that a thread executing in a
       critical section always sees the most recent changes to shared variables.
    - It reads these variable from main memory on entry and writes
      values to main memory on exit.
    - In practical terms, on current hardware, this typically causes
      flushing of the CPU caches when a monitor is acquired and writes
      to main memory when it is released, both of which are expensive.
- Synchronisation is implemented using monitors. Each Java object is
  associated with a monitor, which a thread can *lock* or *unlock*
  by acquiring and releasing the monitor's lock (a token).
- When a thread attempts to acquire a lock that it already holds, the
  request succeeds.
- ~java.lang.Thread~ has a ~static boolean holdsLock(Object o)~ method
  that returns ~true~ when the calling thread holds the lock on the
  Object.
- A thread that has acquired a lock *doesn't* release this lock when
  it calls one of the Thread's ~sleep()~ methods.
- ~volatile~ exhibits the property of *visibility*.
  - Using volatile, forces all accesses (read or write) to the
    volatile variable to occur to main memory, effectively keeping the
    volatile variable out of CPU caches.
  - Use ~volatile~ only when visibility is an issue.
  - Only *field* can be declared as volatile, not on local variable.
  - You can declare ~double~ and ~long~ fields to be ~volatile~, but
    should avoid on *32-bit* JVMs because it takes two operations to
    access a ~double~ or ~long~ value.
  - ~volatile~ field cannot also be declared ~final~. But this isn't a
    problem because ~final~ field can be safely accessed without
    synchronization.
  - ~volatile~ along can be thread unsafe if the operation involve the
    volatile variable has multiple step. For example:
    - *check-then-act*
    - *read-modify-write*
  - [[http://stackoverflow.com/questions/3519664/difference-between-volatile-and-synchronized-in-java]]

** Waiting and Notification
- The ~wait/notify~ enables one thread waits for a *condition* to
  exist. And another thread to create the condition and then notify
  the waiting thread.
- ~void wait()~: cause the current thread to wait until another thread
  invokes the ~notify()~ or ~notifyAll()~, or for some other thread to
  interrupt the current thread while waiting.
- ~void notify()~: Wake up a *single* thread that's waiting on this
  object's monitor.
  - If more than one threads are waiting on this object,
    one(arbitrary) of them is chosen.
  - The awakened thread will not be able to proceed until the current
    thread relinquishes the lock on this object.
  - A thread releases ownership of the monitor associated with the
    object whose ~wait()~ method is called.
- This API leverages an object's *condition queue*, which is a
  data structure that stores threads waiting for a condition to exists.
  - The waiting threads are known as the *wait set*.
  - Because the condition queue is tightly bound to an object's lock,
    all methods in this API must be called from within a synchronized
    context. The current thread must be the owner of the object's
    monitor.
    #+BEGIN_SRC java
      synchronized(obj){
          while (<condition does not hold)
              obj.wait();
          //perform an action that's appropriate to condition.
      }
    #+END_SRC
    - Because of the possibility of *spurious wakeups*, a thread might
      wakes up without being notified, interrupted, or timingout),
      ~wait()~ is called from within the ~while~ loop.
    - Never call a ~wait()~ outside a loop.
  - Otherwise *java.lang.IllegalMonitorStateException* is thrown.
- In *java.util.concurrent.locks.Condition*, it factors out these
  Object's monitor methods into distinct objects to give the effect of
  having multiple *wait-sets* per object, by combining them with the
  use of arbitrary *Lock* implementations.
- Where a *Lock* replaces the use of ~synchronized~ methods and
  statements, a *Condition* replaces the use of the Object monitor
  methods.

** Concurrency Utilities and Executors
- The *ExecutorService* extends *Executor*, is typically implemented
  by a thread pool.
  - ~invokeAll~, ~invokeAny~ perform the bulk execution, executing a
    collection of tasks and then waiting for at least one, or all, to
    complete.
- *CompletionService* interface and its implementation
  *ExecutorCompletionService*, arranges that submitted tasks are, upon
  completion, placed on a queue accessible using
  - ~take()~: which will block until a result is available.
  - ~poll()~: which will return ~null~ if no result is available.

