posts/notes/java-concurrency/index.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Synchronization</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>
<code>counter++</code> : although a it might look like a single operation, it
is actually three separate operations: read, add 1 and write. It is
not thread safe.
</li>
<li>The compiler, the Java virtual machine (JVM), and the operating
system can collaborate to cache a variable in a register or a
processor-local cacherather than rely on main memory.
<ul class="org-ul">
<li>
<b>Each thread</b> has its <b>own copy</b> of the variable.
</li>
<li>When one thread writes to this variable, it’s writing to its copy;
</li>
<li>Other threads are unlikely to see the update in their copies.
</li>
</ul>
</li>
<li>Synchronization properties:
<dl class="org-dl">
<dt> mutual exclusion </dt>
<dd>each thread is mutually excluded from
executing in critical section when another thread is inside the
critical section.
<ul class="org-ul">
<li>the lock is often referred to as <b>mutex lock</b>
</li>
</ul>
</dd>
<dt> property of visibility </dt>
<dd>ensures that a thread executing in a
critical section always sees the most recent changes to shared variables.
<ul class="org-ul">
<li>It reads these variable from main memory on entry and writes
values to main memory on exit.
</li>
<li>In practical terms, on current hardware, this typically causes
flushing of the CPU caches when a monitor is acquired and writes
to main memory when it is released, both of which are expensive.
</li>
</ul>
</dd>
</dl>
</li>
<li>Synchronisation is implemented using monitors. Each Java object is
associated with a monitor, which a thread can <b>lock</b> or <b>unlock</b>
by acquiring and releasing the monitor's lock (a token).
</li>
<li>When a thread attempts to acquire a lock that it already holds, the
request succeeds.
</li>
<li>
<code>java.lang.Thread</code> has a <code>static boolean holdsLock(Object o)</code> method
that returns <code>true</code> when the calling thread holds the lock on the
Object.
</li>
<li>A thread that has acquired a lock <b>doesn't</b> release this lock when
it calls one of the Thread's <code>sleep()</code> methods.
</li>
<li>
<code>volatile</code> exhibits the property of <b>visibility</b>.
<ul class="org-ul">
<li>Using volatile, forces all accesses (read or write) to the
volatile variable to occur to main memory, effectively keeping the
volatile variable out of CPU caches.
</li>
<li>Use <code>volatile</code> only when visibility is an issue.
</li>
<li>Only <b>field</b> can be declared as volatile, not on local variable.
</li>
<li>You can declare <code>double</code> and <code>long</code> fields to be <code>volatile</code>, but
should avoid on <b>32-bit</b> JVMs because it takes two operations to
access a <code>double</code> or <code>long</code> value.
</li>
<li>
<code>volatile</code> field cannot also be declared <code>final</code>. But this isn't a
problem because <code>final</code> field can be safely accessed without
synchronization.
</li>
<li>
<code>volatile</code> along can be thread unsafe if the operation involve the
volatile variable has multiple step. For example:
<ul class="org-ul">
<li>
<b>check-then-act</b>
</li>
<li>
<b>read-modify-write</b>
</li>
</ul>
</li>
<li>
<a href="http://stackoverflow.com/questions/3519664/difference-between-volatile-and-synchronized-in-java">http://stackoverflow.com/questions/3519664/difference-between-volatile-and-synchronized-in-java</a>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Waiting and Notification</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>The <code>wait/notify</code> enables one thread waits for a <b>condition</b> to
exist. And another thread to create the condition and then notify
the waiting thread.
</li>
<li>
<code>void wait()</code>: cause the current thread to wait until another thread
invokes the <code>notify()</code> or <code>notifyAll()</code>, or for some other thread to
interrupt the current thread while waiting.
</li>
<li>
<code>void notify()</code>: Wake up a <b>single</b> thread that's waiting on this
object's monitor.
<ul class="org-ul">
<li>If more than one threads are waiting on this object,
one(arbitrary) of them is chosen.
</li>
<li>The awakened thread will not be able to proceed until the current
thread relinquishes the lock on this object.
</li>
<li>A thread releases ownership of the monitor associated with the
object whose <code>wait()</code> method is called.
</li>
</ul>
</li>
<li>This API leverages an object's <b>condition queue</b>, which is a
data structure that stores threads waiting for a condition to exists.
<ul class="org-ul">
<li>The waiting threads are known as the <b>wait set</b>.
</li>
<li>Because the condition queue is tightly bound to an object's lock,
all methods in this API must be called from within a synchronized
context. The current thread must be the owner of the object's
monitor.
<div class="highlight"><pre><span></span><span class="kd">synchronized</span><span class="o">(</span><span class="n">obj</span><span class="o">){</span>
    <span class="k">while</span> <span class="o">(&lt;</span><span class="n">condition</span> <span class="n">does</span> <span class="n">not</span> <span class="n">hold</span><span class="o">)</span>
	<span class="n">obj</span><span class="o">.</span><span class="na">wait</span><span class="o">();</span>
    <span class="c1">//perform an action that's appropriate to condition.</span>
<span class="o">}</span>
</pre></div>
<ul class="org-ul">
<li>Because of the possibility of <b>spurious wakeups</b>, a thread might
wakes up without being notified, interrupted, or timingout),
<code>wait()</code> is called from within the <code>while</code> loop.
</li>
<li>Never call a <code>wait()</code> outside a loop.
</li>
</ul>
</li>
<li>Otherwise <b>java.lang.IllegalMonitorStateException</b> is thrown.
</li>
</ul>
</li>
<li>In <b>java.util.concurrent.locks.Condition</b>, it factors out these
Object's monitor methods into distinct objects to give the effect of
having multiple <b>wait-sets</b> per object, by combining them with the
use of arbitrary <b>Lock</b> implementations.
</li>
<li>Where a <b>Lock</b> replaces the use of <code>synchronized</code> methods and
statements, a <b>Condition</b> replaces the use of the Object monitor
methods.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Concurrency Utilities and Executors</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>The <b>ExecutorService</b> extends <b>Executor</b>, is typically implemented
by a thread pool.
<ul class="org-ul">
<li>
<code>invokeAll</code>, <code>invokeAny</code> perform the bulk execution, executing a
collection of tasks and then waiting for at least one, or all, to
complete.
</li>
</ul>
</li>
<li>
<b>CompletionService</b> interface and its implementation
<b>ExecutorCompletionService</b>, arranges that submitted tasks are, upon
completion, placed on a queue accessible using
<ul class="org-ul">
<li>
<code>take()</code>: which will block until a result is available.
</li>
<li>
<code>poll()</code>: which will return <code>null</code> if no result is available.
</li>
</ul>
</li>
</ul>
</div>
</div>
