posts/java-concurrency/index.org
** Synchronizers
- Countdown Latches : causes one or more threads to wait at a /gate/
  until another thread open this gate, at which point these other
  threads can continue.
  - ~void await(), void await(long timeout, TimeUnit unit)~
  - ~void countDown()~
- Cyclic Barriers : lets a set of threads wait for each other to reach
  a common barrier point.
  - Useful in *parallel decomposition* scenarios, where a lengthy task
    is divided into subtasks whose individual results are later merged
    into the overall result of the task.
  - The barrier is /cyclic/ because it can be reused after the waiting
    threads are released.
  - ~CyclicBarrier(int parties)~ : specific number of parties( threads
    working toward a common goal)
  - ~CyclicBarrier(int parties, Runnable barrierAction)~ : the
    barrierAction is executed when the barrier is /tripped/.
  - ~int await(), int ~await(long timeout, TimeUnit unit)~ : force
    the calling thread to wait until all parties have invoked
    ~await()~ on this cyclic barrier.
    - the method return the arrival index of the calling thread, where
      a index  ~getParties() -1~ indicates the first thread to arrive,
      and ~zero~ indicates the last thread to arrive (countdown).
    - The calling thread will *also stop waiting* when it, or *another
      waiting thread* is interrupted, timeout, or ~reset()~ is called
      on this cyclic barrier.
    - If the calling thread on wait is interrupted, this thread will
      throw *InterruptedException*, while other waiting thread will
      throw *BrokenBarrierException*
  - ~boolean isBroken()~ : return ~true~ when one or more parties
    broke out of this barrier because of interruption or timeout
    since the cyclic barrier was constructed, or last reset.
  - ~void reset()~ : reset the barrier to its initial state. If any
    parties are currently waiting at the barrier, they will return
    with a *BrokenBarrierException*.
- Exchangers :provides a synchronization point where threads can swap
  objects.
  - Each thread presents some boject on entry to the exchanger's
    ~exchange()~ method, matches with a partner thread, and receives
    its partner's object on return.
  - Useful in applications such as genetic algorithms and pipeline
    design.
  - ~java.util.concurrent.Exchanger<V>~ has ~V exchange(V x)~ method:
    wait for another thread to arrive at this exchange point and then
    transfer the given object to it, receiving the other thread's
    object in return.
    - If another thread is already waiting at the exchange point:
      - It is resumed for thread-scheduling purposes and receives the
        object passed in by the calling thread.
      - The current threads return immediately.
- Semaphores : maintains a set of *permits* for restricting the member
  of threads that can access a limited resource.
  - A thread attempting to acquire a permit when no permits are
    available blocks until some other thread releases a permit.
  - Semaphores whose values can be more than 1 are known as *counting
    semaphores*
  - Semaphores whoese value can be only 0 or 1 are known as *binary
    semaphores*, or *mutexes*.
  - Semaphore can set to be fair (fairness policy) :
    - when ~false~, i.e., not fair, it makes no guarantees about the
      order in which threads acquire permites.
    - when ~true~, it guarantees the order as in FIFO, i.e., the first
      thread invoking ~acquire()~ will get the permit first.
    - Generally, semaphores used to control resource access should be
      initialized as fair (*by default, it is not*) to ensure that no
      therad is starved out from accessing a resource.
    - When using semaphores for other kinds of synchronization
      control, the throughput advantages of unfair ordering often
      outweight fairness considerations.
    - ~void acquire()~, ~void acquire(int permits)~
    - ~boolean tryAcquire()~, ~boolean tryAcquire(int permits)~:
      acquire permits only when they are available at the time of
      invocation.
    - ~boolean tryAcquire(long timeOut, TimeUnit unit)~
    - ~void release()~, ~void release(int permits)~
    - ~void acquireUninterruptibly()~
    - ~int drainPermits()~: accquire and return a count of all permits
      that are immediately available.
    -
- Phasers : is a more flexible cyclic barrier.
  - Is sueful when we have some concurrent tasks divided in steps. And
    this class enable us to synchronize the threads at the end of each
    steps.
    - so no thread starts its next step until all the threads
      have finished the previous one.
  - Let a group of threads wait on a barrier; these threads continue
    after the last thread arrives.
  - Cyclic barrier coordinates a *fixed* number of threads, while a
    phaser can coordiantes a *variable number* of threads, which can
    register at any time.
  - A *phase* is the phaser's /current state/, and this state is
    identified by an integer-based *phase number*.
  - ~Phaser(int nthreads)~ : constructor creates a phaser that
    initially coordiates ~nthreads~ threads, and whose /phase number/ is
    initially set to ~0~.
  - ~int register()~ : add a new unarrived thread to this phaser and
    returns the phase number to classify the arrival.
  - ~int arriveAndAwaitAdvance()~ : records arrival and *wait* for the
    phaser to advance. Return the phase number to which the arrival
    applies.
  - ~int arriveAndDeregister()~ : arrives at this phaser and
    deregister from it without waiting for others to arrive, reducing
    the number of threads required to avdance in future phases.
  - TODO. need to have better understanding.

