posts/notes/java-concurrency/index.html

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Synchronizers</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Countdown Latches : causes one or more threads to wait at a <i>gate</i>
until another thread open this gate, at which point these other
threads can continue.
<ul class="org-ul">
<li>
<code>void await(), void await(long timeout, TimeUnit unit)</code>
</li>
<li>
<code>void countDown()</code>
</li>
</ul>
</li>
<li>Cyclic Barriers : lets a set of threads wait for each other to reach
a common barrier point.
<ul class="org-ul">
<li>Useful in <b>parallel decomposition</b> scenarios, where a lengthy task
is divided into subtasks whose individual results are later merged
into the overall result of the task.
</li>
<li>The barrier is <i>cyclic</i> because it can be reused after the waiting
threads are released.
</li>
<li>
<code>CyclicBarrier(int parties)</code> : specific number of parties( threads
working toward a common goal)
</li>
<li>
<code>CyclicBarrier(int parties, Runnable barrierAction)</code> : the
barrierAction is executed when the barrier is <i>tripped</i>.
</li>
<li>
<code>int await(), int ~await(long timeout, TimeUnit unit)</code> : force
the calling thread to wait until all parties have invoked
<code>await()</code> on this cyclic barrier.
<ul class="org-ul">
<li>the method return the arrival index of the calling thread, where
a index  <code>getParties() -1</code> indicates the first thread to arrive,
and <code>zero</code> indicates the last thread to arrive (countdown).
</li>
<li>The calling thread will <b>also stop waiting</b> when it, or <b>another
waiting thread</b> is interrupted, timeout, or <code>reset()</code> is called
on this cyclic barrier.
</li>
<li>If the calling thread on wait is interrupted, this thread will
throw <b>InterruptedException</b>, while other waiting thread will
throw <b>BrokenBarrierException</b>
</li>
</ul>
</li>
<li>
<code>boolean isBroken()</code> : return <code>true</code> when one or more parties
broke out of this barrier because of interruption or timeout
since the cyclic barrier was constructed, or last reset.
</li>
<li>
<code>void reset()</code> : reset the barrier to its initial state. If any
parties are currently waiting at the barrier, they will return
with a <b>BrokenBarrierException</b>.
</li>
</ul>
</li>
<li>Exchangers :provides a synchronization point where threads can swap
objects.
<ul class="org-ul">
<li>Each thread presents some boject on entry to the exchanger's
<code>exchange()</code> method, matches with a partner thread, and receives
its partner's object on return.
</li>
<li>Useful in applications such as genetic algorithms and pipeline
design.
</li>
<li>
<code>java.util.concurrent.Exchanger&lt;V&gt;</code> has <code>V exchange(V x)</code> method:
wait for another thread to arrive at this exchange point and then
transfer the given object to it, receiving the other thread's
object in return.
<ul class="org-ul">
<li>If another thread is already waiting at the exchange point:
<ul class="org-ul">
<li>It is resumed for thread-scheduling purposes and receives the
object passed in by the calling thread.
</li>
<li>The current threads return immediately.
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li>Semaphores : maintains a set of <b>permits</b> for restricting the member
of threads that can access a limited resource.
<ul class="org-ul">
<li>A thread attempting to acquire a permit when no permits are
available blocks until some other thread releases a permit.
</li>
<li>Semaphores whose values can be more than 1 are known as <b>counting
semaphores</b>
</li>
<li>Semaphores whoese value can be only 0 or 1 are known as <b>binary
semaphores</b>, or <b>mutexes</b>.
</li>
<li>Semaphore can set to be fair (fairness policy) :
<ul class="org-ul">
<li>when <code>false</code>, i.e., not fair, it makes no guarantees about the
order in which threads acquire permites.
</li>
<li>when <code>true</code>, it guarantees the order as in FIFO, i.e., the first
thread invoking <code>acquire()</code> will get the permit first.
</li>
<li>Generally, semaphores used to control resource access should be
initialized as fair (<b>by default, it is not</b>) to ensure that no
therad is starved out from accessing a resource.
</li>
<li>When using semaphores for other kinds of synchronization
control, the throughput advantages of unfair ordering often
outweight fairness considerations.
</li>
<li>
<code>void acquire()</code>, <code>void acquire(int permits)</code>
</li>
<li>
<code>boolean tryAcquire()</code>, <code>boolean tryAcquire(int permits)</code>:
acquire permits only when they are available at the time of
invocation.
</li>
<li>
<code>boolean tryAcquire(long timeOut, TimeUnit unit)</code>
</li>
<li>
<code>void release()</code>, <code>void release(int permits)</code>
</li>
<li>
<code>void acquireUninterruptibly()</code>
</li>
<li>
<code>int drainPermits()</code>: accquire and return a count of all permits
that are immediately available.
</li>
<li>
</li>
</ul>
</li>
</ul>
</li>
<li>Phasers : is a more flexible cyclic barrier.
<ul class="org-ul">
<li>Is sueful when we have some concurrent tasks divided in steps. And
this class enable us to synchronize the threads at the end of each
steps.
<ul class="org-ul">
<li>so no thread starts its next step until all the threads
have finished the previous one.
</li>
</ul>
</li>
<li>Let a group of threads wait on a barrier; these threads continue
after the last thread arrives.
</li>
<li>Cyclic barrier coordinates a <b>fixed</b> number of threads, while a
phaser can coordiantes a <b>variable number</b> of threads, which can
register at any time.
</li>
<li>A <b>phase</b> is the phaser's <i>current state</i>, and this state is
identified by an integer-based <b>phase number</b>.
</li>
<li>
<code>Phaser(int nthreads)</code> : constructor creates a phaser that
initially coordiates <code>nthreads</code> threads, and whose <i>phase number</i> is
initially set to <code>0</code>.
</li>
<li>
<code>int register()</code> : add a new unarrived thread to this phaser and
returns the phase number to classify the arrival.
</li>
<li>
<code>int arriveAndAwaitAdvance()</code> : records arrival and <b>wait</b> for the
phaser to advance. Return the phase number to which the arrival
applies.
</li>
<li>
<code>int arriveAndDeregister()</code> : arrives at this phaser and
deregister from it without waiting for others to arrive, reducing
the number of threads required to avdance in future phases.
</li>
<li>TODO. need to have better understanding.
</li>
</ul>
</li>
</ul>
</div>
</div>
