posts/java-concurrency/index.org
** The Locking Framework
- ~synchronized~ keyword is to wrap *critical sections*. JVM supports
  synchronization via monitors and the ~monitorenter~ and
  ~monitorexit~ JVM instructions.
  - Every Java object is associated with a monitor, which is *a mutual
    exclusion* construct.
  - When a thread locks a monitor in multicore/multiprocessor
    environment, the value of shared variables that are stored in main
    memory are read into the *local memory* or *cache memory* of the
    thread.
  - When a thread unlock the monitor while leaving the critical section,
    the values in its copies are written back to main memory.
- The more flexible *Lock* interface:
  - ~void lock()~ : doesn't allow for interruption.
  - ~void lockInterruptibly()~ : allow for interruption.
  - ~boolean tryLock()~, ~boolean tryLock(long time, TimeUnit unit)~ :
    timeout, or interrupted.
  - ~void unlock()~
- *ReentrantLock* class implements the *Lock* interface.
  - It is a reentrant mutual exclusion lock.
  - This lock is associated with a hold count.
    - When a thread holds the lock and *reacquires* the lock, the hold
      count increase by 1.
    - When unlock from the thread, the hold count is decreased by 1.
    - The lock is released when the count reaches 0.
    - This is why it is called a *reentrant* lock.
  - ReentrantLock also support a fair ordering policy, by default
    false.
  - ~boolean isHeldByCurrentThread()~ return true when the lock is
    hold by the current thread.
- *Condition* interface factors out Object's wait and notification
  methods into distinct condition objects.
  - ~await()~ : wait to be signalled by the same condition.
    - The lock associated with this Condition is automatically
      released and the current thread become disabled for thread
      scheduling purpose and lies dormant until one of the following
      four things happens:
      - ~signal()~ called and the current thead happens to be chose to
        be awaken.
      - ~signalAll()~ called.
      - Is interrupted.
      - A /spurious wakeup/ occurs: this is why the await normally
        need to be wrapped in while loop.
    - In all cases, before ~await()~ can return, the current thread
      must *re-acquire* the lock associated with this condition. The
      thread is guaranteed to hold this lock when the method return.
  - ~signal()~, ~signalAll()~
  - The two methods are protected with the lock to ensure mutual
    exclusion.
  - the ~await()~ is normally wrapped in a while loop on the checked
    condition.
- The Lock replaces synchronized methods, Condition replaces Object's
  wait/notification methods.
- A Condition instance is intrinsically bound to a lock. To obtain a
  Condition instance for a certain Lock instance, use the Lock's
  ~newCondition()~ method.
- Multiple condition can be created from a Lock.
- Example:
  #+BEGIN_SRC java
    class BoundedBuffer {
        final Lock lock = new ReentrantLock();
        final Condition notFull  = lock.newCondition();
        final Condition notEmpty = lock.newCondition();

        final Object[] items = new Object[100];
        int putptr, takeptr, count;

        public void put(Object x) throws InterruptedException {
            lock.lock();
            try {
                while (count == items.length)
                    notFull.await();
                items[putptr] = x;
                if (++putptr == items.length) putptr = 0;
                ++count;
                notEmpty.signal();
            } finally {
                lock.unlock();
            }
        }

        public Object take() throws InterruptedException {
            lock.lock();
            try {
                while (count == 0)
                    notEmpty.await();
                Object x = items[takeptr];
                if (++takeptr == items.length) takeptr = 0;
                --count;
                notFull.signal();
                return x;
            } finally {
                lock.unlock();
            }
        }
    }

  #+END_SRC
- *ReadWriteLock* interface defines a pair of locks: one for read-only
  operations and one for write operations.
  - The read lock may be held simultaneously by multiple reader
    threads as long as there are no writes.
  - The write lock is exclusive: only a single thread can modify
    shared data.
- *ReadWriteLock* is implemented by the *ReentrantReadWriteLock*
  class.
- *StampedLock* is another implementation of *ReadWriteLock*. The main
  differences are:
  - StampedLock allow optimistic locking for read operations.
  - ReentrantReadWriteLock are reentrant while stampedlock are not.
  - When the readers are much more than writers, the StampedLock can
    significantly improve performance.

