posts/notes/java-concurrency/index.html

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">The Locking Framework</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>
<code>synchronized</code> keyword is to wrap <b>critical sections</b>. JVM supports
synchronization via monitors and the <code>monitorenter</code> and
<code>monitorexit</code> JVM instructions.
<ul class="org-ul">
<li>Every Java object is associated with a monitor, which is <b>a mutual
exclusion</b> construct.
</li>
<li>When a thread locks a monitor in multicore/multiprocessor
environment, the value of shared variables that are stored in main
memory are read into the <b>local memory</b> or <b>cache memory</b> of the
thread.
</li>
<li>When a thread unlock the monitor while leaving the critical section,
the values in its copies are written back to main memory.
</li>
</ul>
</li>
<li>The more flexible <b>Lock</b> interface:
<ul class="org-ul">
<li>
<code>void lock()</code> : doesn't allow for interruption.
</li>
<li>
<code>void lockInterruptibly()</code> : allow for interruption.
</li>
<li>
<code>boolean tryLock()</code>, <code>boolean tryLock(long time, TimeUnit unit)</code> :
timeout, or interrupted.
</li>
<li>
<code>void unlock()</code>
</li>
</ul>
</li>
<li>
<b>ReentrantLock</b> class implements the <b>Lock</b> interface.
<ul class="org-ul">
<li>It is a reentrant mutual exclusion lock.
</li>
<li>This lock is associated with a hold count.
<ul class="org-ul">
<li>When a thread holds the lock and <b>reacquires</b> the lock, the hold
count increase by 1.
</li>
<li>When unlock from the thread, the hold count is decreased by 1.
</li>
<li>The lock is released when the count reaches 0.
</li>
<li>This is why it is called a <b>reentrant</b> lock.
</li>
</ul>
</li>
<li>ReentrantLock also support a fair ordering policy, by default
false.
</li>
<li>
<code>boolean isHeldByCurrentThread()</code> return true when the lock is
hold by the current thread.
</li>
</ul>
</li>
<li>
<b>Condition</b> interface factors out Object's wait and notification
methods into distinct condition objects.
<ul class="org-ul">
<li>
<code>await()</code> : wait to be signalled by the same condition.
<ul class="org-ul">
<li>The lock associated with this Condition is automatically
released and the current thread become disabled for thread
scheduling purpose and lies dormant until one of the following
four things happens:
<ul class="org-ul">
<li>
<code>signal()</code> called and the current thead happens to be chose to
be awaken.
</li>
<li>
<code>signalAll()</code> called.
</li>
<li>Is interrupted.
</li>
<li>A <i>spurious wakeup</i> occurs: this is why the await normally
need to be wrapped in while loop.
</li>
</ul>
</li>
<li>In all cases, before <code>await()</code> can return, the current thread
must <b>re-acquire</b> the lock associated with this condition. The
thread is guaranteed to hold this lock when the method return.
</li>
</ul>
</li>
<li>
<code>signal()</code>, <code>signalAll()</code>
</li>
<li>The two methods are protected with the lock to ensure mutual
exclusion.
</li>
<li>the <code>await()</code> is normally wrapped in a while loop on the checked
condition.
</li>
</ul>
</li>
<li>The Lock replaces synchronized methods, Condition replaces Object's
wait/notification methods.
</li>
<li>A Condition instance is intrinsically bound to a lock. To obtain a
Condition instance for a certain Lock instance, use the Lock's
<code>newCondition()</code> method.
</li>
<li>Multiple condition can be created from a Lock.
</li>
<li>Example:
<div class="highlight"><pre><span></span><span class="kd">class</span> <span class="nc">BoundedBuffer</span> <span class="o">{</span>
    <span class="kd">final</span> <span class="n">Lock</span> <span class="n">lock</span> <span class="o">=</span> <span class="k">new</span> <span class="n">ReentrantLock</span><span class="o">();</span>
    <span class="kd">final</span> <span class="n">Condition</span> <span class="n">notFull</span>  <span class="o">=</span> <span class="n">lock</span><span class="o">.</span><span class="na">newCondition</span><span class="o">();</span>
    <span class="kd">final</span> <span class="n">Condition</span> <span class="n">notEmpty</span> <span class="o">=</span> <span class="n">lock</span><span class="o">.</span><span class="na">newCondition</span><span class="o">();</span>

    <span class="kd">final</span> <span class="n">Object</span><span class="o">[]</span> <span class="n">items</span> <span class="o">=</span> <span class="k">new</span> <span class="n">Object</span><span class="o">[</span><span class="mi">100</span><span class="o">];</span>
    <span class="kt">int</span> <span class="n">putptr</span><span class="o">,</span> <span class="n">takeptr</span><span class="o">,</span> <span class="n">count</span><span class="o">;</span>

    <span class="kd">public</span> <span class="kt">void</span> <span class="nf">put</span><span class="o">(</span><span class="n">Object</span> <span class="n">x</span><span class="o">)</span> <span class="kd">throws</span> <span class="n">InterruptedException</span> <span class="o">{</span>
	<span class="n">lock</span><span class="o">.</span><span class="na">lock</span><span class="o">();</span>
	<span class="k">try</span> <span class="o">{</span>
	    <span class="k">while</span> <span class="o">(</span><span class="n">count</span> <span class="o">==</span> <span class="n">items</span><span class="o">.</span><span class="na">length</span><span class="o">)</span>
		<span class="n">notFull</span><span class="o">.</span><span class="na">await</span><span class="o">();</span>
	    <span class="n">items</span><span class="o">[</span><span class="n">putptr</span><span class="o">]</span> <span class="o">=</span> <span class="n">x</span><span class="o">;</span>
	    <span class="k">if</span> <span class="o">(++</span><span class="n">putptr</span> <span class="o">==</span> <span class="n">items</span><span class="o">.</span><span class="na">length</span><span class="o">)</span> <span class="n">putptr</span> <span class="o">=</span> <span class="mi">0</span><span class="o">;</span>
	    <span class="o">++</span><span class="n">count</span><span class="o">;</span>
	    <span class="n">notEmpty</span><span class="o">.</span><span class="na">signal</span><span class="o">();</span>
	<span class="o">}</span> <span class="k">finally</span> <span class="o">{</span>
	    <span class="n">lock</span><span class="o">.</span><span class="na">unlock</span><span class="o">();</span>
	<span class="o">}</span>
    <span class="o">}</span>

    <span class="kd">public</span> <span class="n">Object</span> <span class="nf">take</span><span class="o">()</span> <span class="kd">throws</span> <span class="n">InterruptedException</span> <span class="o">{</span>
	<span class="n">lock</span><span class="o">.</span><span class="na">lock</span><span class="o">();</span>
	<span class="k">try</span> <span class="o">{</span>
	    <span class="k">while</span> <span class="o">(</span><span class="n">count</span> <span class="o">==</span> <span class="mi">0</span><span class="o">)</span>
		<span class="n">notEmpty</span><span class="o">.</span><span class="na">await</span><span class="o">();</span>
	    <span class="n">Object</span> <span class="n">x</span> <span class="o">=</span> <span class="n">items</span><span class="o">[</span><span class="n">takeptr</span><span class="o">];</span>
	    <span class="k">if</span> <span class="o">(++</span><span class="n">takeptr</span> <span class="o">==</span> <span class="n">items</span><span class="o">.</span><span class="na">length</span><span class="o">)</span> <span class="n">takeptr</span> <span class="o">=</span> <span class="mi">0</span><span class="o">;</span>
	    <span class="o">--</span><span class="n">count</span><span class="o">;</span>
	    <span class="n">notFull</span><span class="o">.</span><span class="na">signal</span><span class="o">();</span>
	    <span class="k">return</span> <span class="n">x</span><span class="o">;</span>
	<span class="o">}</span> <span class="k">finally</span> <span class="o">{</span>
	    <span class="n">lock</span><span class="o">.</span><span class="na">unlock</span><span class="o">();</span>
	<span class="o">}</span>
    <span class="o">}</span>
<span class="o">}</span>
</pre></div>
</li>
<li>
<b>ReadWriteLock</b> interface defines a pair of locks: one for read-only
operations and one for write operations.
<ul class="org-ul">
<li>The read lock may be held simultaneously by multiple reader
threads as long as there are no writes.
</li>
<li>The write lock is exclusive: only a single thread can modify
shared data.
</li>
</ul>
</li>
<li>
<b>ReadWriteLock</b> is implemented by the <b>ReentrantReadWriteLock</b>
  class.
</li>
<li>
<b>StampedLock</b> is another implementation of <b>ReadWriteLock</b>. The main
differences are:
<ul class="org-ul">
<li>StampedLock allow optimistic locking for read operations.
</li>
<li>ReentrantReadWriteLock are reentrant while stampedlock are not.
</li>
<li>When the readers are much more than writers, the StampedLock can
significantly improve performance.
</li>
</ul>
</li>
</ul>
</div>
</div>
