posts/java-concurrency/index.org
** LockSupport
- This class associates with each thread that uses it, *a permit* (in
  the sense of the Semaphore class).
  - A call to ~static void park()~ return immediately if the permit is available,
    consuming it in the process; otherwise it *may* block.
  - A call to ~static void unpark(Thread thread)~, if it was not
    already available.
  - ~park()~ will return if the caller's thread was interrupted, and
    timeout versions are supported
  - The ~park()~ method may also return at any other time, for "*no
    reason*", so in general must be invoked within a loop that
    rechecks condition upon return.
  - In this sense, ~park~ serves as an optimization of a *busy wait*
    that doesn't waste as much time spining, but must be paired with
    an ~unpark~ to be effective.
- Unlike Semaphore's permits, permits of LockSupport are associated
  with threads (i.e. permit is given to a particular thread) and
  doesn't accumulate, i.e. there can be only one permit per thread,
  when thread consumes the permit, it disappears).
- You can give permit to a thread by calling unpark(). When permit is
  available, the parked thread consumes it and exits a park() method.

** Concurrent Collections
- The concurrent collections return *weakly-consistent iterators*:
  - An elements that is removed after iteration starts but hasn't yet
    been returned via the iterator's ~next()~ method *won't* be
    returned.
  - An element that's added after iteration starts *may or may not* be
    returned.
  - No element is returned more than once during the iteration of a
    collection, regardless of changes made to the collection during
    iteration.
- *BlockingQueue*'s implementation:
  - *ArrayBlockingQueue*
  - *LinkedBlockingQueue*
  - *PriorityBlockingQueue*
  - *SynchronousQueue*
  - *DelayQueue*
  - *LinkedTransferQueue*
- *ConcurrentMap*'s additional methods:
  - ~V putIfAbsent(K key, V value)~ : combines the ~containsKey~ and
    ~put~ for a atomic operation.
  - ~boolean remove(Object key, Object value)~ : remove the entry for
    a key only if currently mapped to a given value.
  - ~boolean replace(K key, V oldValue, V newValue)~: replace the
    entry for a key only if currently mapped to a given value.

** Atomic Variables
- The atomic classes extends the notion of ~volatile~ values, fields,
  and array elements to those that also provide an atomic conditional
  update so that external synchronisation isn't required.
- The atomic arrays: *AtomicIntegerArray*, *AtomicLongArray* and
  *AtomicReferenceArray*. Its elements may be updated atomically.
- For scalability problem in the context of maintaining a single
  *count*, a *sum* or some other value with the possibility of updates
  from many threads:
  - Internally employ contention-reduction techniques that provide
    huge throughput improvements compared to atomic variables.
  - *DoubleAccumulator* and *LongAccumulator*: Take a BinaryOperator
  - *DoubleAdder* and *LongAdder*: provides analogy of the
    functionality of the accumulators for the common special case of
    maintaining counts and sums.
  - ~new LongAdder()~ is equivalent to \\
    ~new LongAccumulator ((x+y)->x+y), 0l)~
- Java's low-level synchronisation mechanism impacts hardware
  utilisation and scalability in the following ways:
  - *Contended synchronisation* where multiple threads constantly
    competing for a lock, is expensive and throughput suffers as a result.
    - The expense is caused mainly by the frequent *context switching*.
    - Each *context switch* operation can take many processor cycles to
      complete.
    - Modern JVM make *uncontended synchronisation* inexpensive.
  - When a thread holding a lock is delayed (because of a scheduling
    delay for example), no thread that requires that lock makes any progress.
- ~volatile~ cannot be used as a synchronization alternative.
  - ~volatile~ variables only solve the visibility problem.
  - Cannot be used to safely implement the atomic *read-modify-write*
    sequence.
- Compare-and-Swap(CAS) is an *uninterruptible* microprocessor specific
  instruction that :
  1. Read value with an expected value,
  2. Store a new value in the memory location if the read value matches
     the expected value.
  3. Otherwise, nothing is done.
- CAS supports atomic *read-modify-write* sequences:
  1. Read value ~x~ from address ~A~
  2. Perform a multistep computation on ~x~ to drive a new value ~y~
  3. Use CAS to change ghe value of ~A~ from ~x~ to ~y~.
  4. CAS succeeds when ~A~'s value hasn't changed while performing
     these steps.
  5. This is normally wrapped in a while loop to repeat until success.
- *ReentrantLock* offers better performance than ~synchronized~ under
  high thread contention.
  - its synchronization is managed by a subclass of
    ~java.util.concurrent.locks.AbstractQueuedSynchronizer~,
  - which in turn, leverages the ~sun.mics.Unsafe~ class and its
    ~compareAndSwapInt()~ CAS method.
- The atomic variable classes also leverage CAS with a method:
  ~boolean compareAndSet(expectedValue, updateValue)~.

** Fork/Join
- Fork/Join consists of a special *executor service* and *thread
  pool*:
  - The executor service makes a task available to the framework,
  - And this task is broken into smaller tasks that are forked
    (executed by different threads) from the pool.
  - A task waits until joined (its subtasks finish).
- TODO

** CompletionService
- A service that decouples the production of new tasks from the
  consumption of the tasks' results *in the order* they complete.
  - Producer ~submit~
  - Consumer ~poll~ or ~take~
- ~poll()~ : Retrieves and removes the Future representing the next
  completed task, or ~null~ if none are present.
- ~poll(long timeout, TimeUnit unit)~: waiting if necessary.
- ~take()~ : block if none are yet present.
- Difference between executor service and completion service:
  - ExecutorService provides an incoming queue for tasks and provides
    workers threads.
  - CompletionService provides an incoming queue for tasks, worker
    threads, *and* an output queue for storing task results.

