posts/notes/java-concurrency/index.html

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">LockSupport</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>This class associates with each thread that uses it, <b>a permit</b> (in
the sense of the Semaphore class).
<ul class="org-ul">
<li>A call to <code>static void park()</code> return immediately if the permit is available,
consuming it in the process; otherwise it <b>may</b> block.
</li>
<li>A call to <code>static void unpark(Thread thread)</code>, if it was not
already available.
</li>
<li>
<code>park()</code> will return if the caller's thread was interrupted, and
timeout versions are supported
</li>
<li>The <code>park()</code> method may also return at any other time, for "<b>no
reason</b>", so in general must be invoked within a loop that
rechecks condition upon return.
</li>
<li>In this sense, <code>park</code> serves as an optimization of a <b>busy wait</b>
that doesn't waste as much time spining, but must be paired with
an <code>unpark</code> to be effective.
</li>
</ul>
</li>
<li>Unlike Semaphore's permits, permits of LockSupport are associated
with threads (i.e. permit is given to a particular thread) and
doesn't accumulate, i.e. there can be only one permit per thread,
when thread consumes the permit, it disappears).
</li>
<li>You can give permit to a thread by calling unpark(). When permit is
available, the parked thread consumes it and exits a park() method.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">Concurrent Collections</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>The concurrent collections return <b>weakly-consistent iterators</b>:
<ul class="org-ul">
<li>An elements that is removed after iteration starts but hasn't yet
been returned via the iterator's <code>next()</code> method <b>won't</b> be
returned.
</li>
<li>An element that's added after iteration starts <b>may or may not</b> be
returned.
</li>
<li>No element is returned more than once during the iteration of a
collection, regardless of changes made to the collection during
iteration.
</li>
</ul>
</li>
<li>
<b>BlockingQueue</b>'s implementation:
<ul class="org-ul">
<li>
<b>ArrayBlockingQueue</b>
</li>
<li>
<b>LinkedBlockingQueue</b>
</li>
<li>
<b>PriorityBlockingQueue</b>
</li>
<li>
<b>SynchronousQueue</b>
</li>
<li>
<b>DelayQueue</b>
</li>
<li>
<b>LinkedTransferQueue</b>
</li>
</ul>
</li>
<li>
<b>ConcurrentMap</b>'s additional methods:
<ul class="org-ul">
<li>
<code>V putIfAbsent(K key, V value)</code> : combines the <code>containsKey</code> and
<code>put</code> for a atomic operation.
</li>
<li>
<code>boolean remove(Object key, Object value)</code> : remove the entry for
a key only if currently mapped to a given value.
</li>
<li>
<code>boolean replace(K key, V oldValue, V newValue)</code>: replace the
entry for a key only if currently mapped to a given value.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9">Atomic Variables</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>The atomic classes extends the notion of <code>volatile</code> values, fields,
and array elements to those that also provide an atomic conditional
update so that external synchronisation isn't required.
</li>
<li>The atomic arrays: <b>AtomicIntegerArray</b>, <b>AtomicLongArray</b> and
<b>AtomicReferenceArray</b>. Its elements may be updated atomically.
</li>
<li>For scalability problem in the context of maintaining a single
<b>count</b>, a <b>sum</b> or some other value with the possibility of updates
from many threads:
<ul class="org-ul">
<li>Internally employ contention-reduction techniques that provide
huge throughput improvements compared to atomic variables.
</li>
<li>
<b>DoubleAccumulator</b> and <b>LongAccumulator</b>: Take a BinaryOperator
</li>
<li>
<b>DoubleAdder</b> and <b>LongAdder</b>: provides analogy of the
functionality of the accumulators for the common special case of
maintaining counts and sums.
</li>
<li>
<code>new LongAdder()</code> is equivalent to <br><code>new LongAccumulator ((x+y)-&gt;x+y), 0l)</code>
</li>
</ul>
</li>
<li>Java's low-level synchronisation mechanism impacts hardware
utilisation and scalability in the following ways:
<ul class="org-ul">
<li>
<b>Contended synchronisation</b> where multiple threads constantly
competing for a lock, is expensive and throughput suffers as a result.
<ul class="org-ul">
<li>The expense is caused mainly by the frequent <b>context switching</b>.
</li>
<li>Each <b>context switch</b> operation can take many processor cycles to
complete.
</li>
<li>Modern JVM make <b>uncontended synchronisation</b> inexpensive.
</li>
</ul>
</li>
<li>When a thread holding a lock is delayed (because of a scheduling
delay for example), no thread that requires that lock makes any progress.
</li>
</ul>
</li>
<li>
<code>volatile</code> cannot be used as a synchronization alternative.
<ul class="org-ul">
<li>
<code>volatile</code> variables only solve the visibility problem.
</li>
<li>Cannot be used to safely implement the atomic <b>read-modify-write</b>
    sequence.
</li>
</ul>
</li>
<li>Compare-and-Swap(CAS) is an <b>uninterruptible</b> microprocessor specific
instruction that :
<ol class="org-ol">
<li>Read value with an expected value,
</li>
<li>Store a new value in the memory location if the read value matches
the expected value.
</li>
<li>Otherwise, nothing is done.
</li>
</ol>
</li>
<li>CAS supports atomic <b>read-modify-write</b> sequences:
<ol class="org-ol">
<li>Read value <code>x</code> from address <code>A</code>
</li>
<li>Perform a multistep computation on <code>x</code> to drive a new value <code>y</code>
</li>
<li>Use CAS to change ghe value of <code>A</code> from <code>x</code> to <code>y</code>.
</li>
<li>CAS succeeds when <code>A</code>'s value hasn't changed while performing
these steps.
</li>
<li>This is normally wrapped in a while loop to repeat until success.
</li>
</ol>
</li>
<li>
<b>ReentrantLock</b> offers better performance than <code>synchronized</code> under
high thread contention.
<ul class="org-ul">
<li>its synchronization is managed by a subclass of
<code>java.util.concurrent.locks.AbstractQueuedSynchronizer</code>,
</li>
<li>which in turn, leverages the <code>sun.mics.Unsafe</code> class and its
<code>compareAndSwapInt()</code> CAS method.
</li>
</ul>
</li>
<li>The atomic variable classes also leverage CAS with a method:
<code>boolean compareAndSet(expectedValue, updateValue)</code>.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10">Fork/Join</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>Fork/Join consists of a special <b>executor service</b> and <b>thread
pool</b>:
<ul class="org-ul">
<li>The executor service makes a task available to the framework,
</li>
<li>And this task is broken into smaller tasks that are forked
(executed by different threads) from the pool.
</li>
<li>A task waits until joined (its subtasks finish).
</li>
</ul>
</li>
<li>TODO
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11">CompletionService</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>A service that decouples the production of new tasks from the
consumption of the tasks' results <b>in the order</b> they complete.
<ul class="org-ul">
<li>Producer <code>submit</code>
</li>
<li>Consumer <code>poll</code> or <code>take</code>
</li>
</ul>
</li>
<li>
<code>poll()</code> : Retrieves and removes the Future representing the next
completed task, or <code>null</code> if none are present.
</li>
<li>
<code>poll(long timeout, TimeUnit unit)</code>: waiting if necessary.
</li>
<li>
<code>take()</code> : block if none are yet present.
</li>
<li>Difference between executor service and completion service:
<ul class="org-ul">
<li>ExecutorService provides an incoming queue for tasks and provides
workers threads.
</li>
<li>CompletionService provides an incoming queue for tasks, worker
threads, <b>and</b> an output queue for storing task results.
</li>
</ul>
</li>
</ul>
</div>
</div>
