posts/java-concurrency/index.org
** Testing Concurrent Applications
- Monitoring *ReentrantLock* with its methods:
  - ~protected Thead getOwner()~ : return the Thread that currently
    owns this lock, or null if not owned.
    - Noticed that this is a protected method, so to use it one will
      need to extend.
  - ~protected getQueuedThreads()~ : return the collection containing
    the threads that may be waiting to acquire this lock.
  - ~protected getWaitingThreads(Condition condition)~ : return the
    collection containing the threads that may be waiting ont he given
    condition associated with this lock.
  - ~isHeldbycurrentthread()~ queries if this lock is hold by the
    current thread.
  - ~isLocked()~ : indicating if this lock is owned by a thread.
- *MultithreadedTC* is a library for testing concurrent application.
  - It features a *metronome/clock* that is used to provide *fine control*
    over *the sequence of activities* in multiple threads.
  - It supports test cases that execise a *specific* interleaving of
    the threads.
  - It is motivited by the *principle* that /cuncurrent application
    shoul be built using *small concurrent abstractions*/ such as
    /bounded buffers/, /semaphores/ and /latches/.
    - Separating the concurrency logic from the rest of the application
      logic in this way makes it easier to understand and test
      concurrent applications.
    - Since these abstractions are small, it should be possible to
      *deterministically* test every *significant* interleaving in
      separate tests.
  - It uses an internal clock:
    - the clock only advances to the next tick when all threads are
      blocked.
    - waitForTick(1) : makes thread block until the clock reaches tick
      1 before assuming. The interger received in this method is used
      to control the order of execution.
    - assertTick(1) : assert that the clock is in tick 1.
