posts/notes/java-concurrency/index.html

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12">Testing Concurrent Applications</h3>
<div class="outline-text-3" id="text-1-12">
<ul class="org-ul">
<li>Monitoring <b>ReentrantLock</b> with its methods:
<ul class="org-ul">
<li>
<code>protected Thead getOwner()</code> : return the Thread that currently
owns this lock, or null if not owned.
<ul class="org-ul">
<li>Noticed that this is a protected method, so to use it one will
need to extend.
</li>
</ul>
</li>
<li>
<code>protected getQueuedThreads()</code> : return the collection containing
the threads that may be waiting to acquire this lock.
</li>
<li>
<code>protected getWaitingThreads(Condition condition)</code> : return the
collection containing the threads that may be waiting ont he given
condition associated with this lock.
</li>
<li>
<code>isHeldbycurrentthread()</code> queries if this lock is hold by the
current thread.
</li>
<li>
<code>isLocked()</code> : indicating if this lock is owned by a thread.
</li>
</ul>
</li>
<li>
<b>MultithreadedTC</b> is a library for testing concurrent application.
<ul class="org-ul">
<li>It features a <b>metronome/clock</b> that is used to provide <b>fine control</b>
    over <b>the sequence of activities</b> in multiple threads.
</li>
<li>It supports test cases that execise a <b>specific</b> interleaving of
the threads.
</li>
<li>It is motivited by the <b>principle</b> that <i>cuncurrent application
shoul be built using <b>small concurrent abstractions</b></i> such as
<i>bounded buffers</i>, <i>semaphores</i> and <i>latches</i>.
<ul class="org-ul">
<li>Separating the concurrency logic from the rest of the application
logic in this way makes it easier to understand and test
concurrent applications.
</li>
<li>Since these abstractions are small, it should be possible to
<b>deterministically</b> test every <b>significant</b> interleaving in
separate tests.
</li>
</ul>
</li>
<li>It uses an internal clock:
<ul class="org-ul">
<li>the clock only advances to the next tick when all threads are
blocked.
</li>
<li>waitForTick(1) : makes thread block until the clock reaches tick
1 before assuming. The interger received in this method is used
to control the order of execution.
</li>
<li>assertTick(1) : assert that the clock is in tick 1.
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/concurrency/" rel="tag">concurrency</a></li>
            <li><a class="tag p-category" href="../../../categories/java/" rel="tag">java</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../java-hotspot-gc/" rel="prev" title="Java HotSpot VM GC Tunning Guide">Previous post</a>
            </li>
            <li class="next">
                <a href="../java-8-topics/" rel="next" title="Java 8 Topics">Next post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2017         <a href="mailto:wudong@graceliu.uk">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../../assets/js/jquery.min.js"></script><script src="../../../assets/js/moment-with-locales.min.js"></script><script src="../../../assets/js/fancydates.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
